<?php
require_once "common.php";
if(isset($_REQUEST["giveup"])){
common\run_timekeeper_command("giveup");
header("Location:index.php?second=true");
}
?>
<!DOCTYPE HTML>
<html lang="ja">
<head>
<meta charset="UTF-8">
<?php
echo ("<title> " . common\get_nTry() . "回目 - 実験ページ </title>");
?>
<link rel="stylesheet" type="text/css" href="common.css">
<link rel="stylesheet" type="text/css" href="index.css">
</head>
<body >
<h1 class="title_header">視覚障害者を対象とした、モダンなウェブ技術の学習フレームワークの開発と評価</h1>

<h2 class="title_header_name">慶應義塾大学 / 野澤幸男</h2>
<p>このたびは、実験にご協力いただき、ありがとうございます。このページの説明を読んでから、「次へ進む」ボタンを押して、実験を開始してください。</p>

<h2>実験の内容</h2>
<p>今から、実験用に作った「なんちゃってショッピングサイト」で、好きな商品を購入する操作をしていただきます。手順としては、商品を検索し、カートにいれ、ログインして、購入…という、4つのステップがあります。</p>
<p>各ページの一番上に、やるべき作業の説明があります。それを読んで、書かれている操作を順番に実行していってください。<br>全て問題なくできれば、めでたく商品購入です（でも、今回は実験なので、実際に商品はあげられません、ごめんなさい！）。

<h2>今回のルール</h2>
<?php
if (common\get_nTry() == 1) {
    ?>
<p>今から行う実験は1回目です。1回目の実験では、ページ上部の説明以外、操作ガイドはつきません。</p>
<p>1回目の実験では、途中で操作が分からなくなって、もうどうしようもないと思ったら、いつでもギブアップすることができます。ギブアップしたい場合は、実験担当者に「ギブアップ」と伝えてください。<br>その時点で、直ちに1回目を終了します。</p>
<p>なお、ギブアップは、あくまでも「操作が分からなくてこれ以上進めない」というときに宣言してください。また、時間の関係で、20分経っても作業が終わらなかった場合には、<br>その時点でギブアップとさせていただきます。</p>
<?php
} else {
    ?>
<p>今から行う実験は2回目です。2回目の実験では、ページ上部の説明のほかに、画面読み上げソフトによる操作ガイドを利用できます。</p>
<p>途中で操作が分からないと思ったら、f1キーを押してください。どのような操作をすべきかを案内してくれます。なお、f1キーにはシールが貼ってあります。</p>
<p>2回目の実験では、ギブアップの宣言はできません。操作に困ったら、f1キーで聞ける説明を使って、自力で何とかしてみてください。20分が経過したら、実験を終了します。</p>
<?php
}
?>
<h2>説明は以上です。下の「次へ進む」ボタンを押して、実験を開始してください。</h2>
<?php
echo ("<button type=\"button\" onclick=\"location.href='exp_page1.php?second=" . common\get_second_param() . "';\">次へ進む</button>");
common\print_hooter(false);
?>
</body>
</html>
